shell/tsung_test.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">

<tsung loglevel="notice" dumptraffic="false" version="1.0">

  <clients>
    <client host="localhost" use_controller_vm="true"  maxusers="100000" />
  </clients>

  <servers>
    <server host="@server" port="@port" type="tcp"/>
    <!--
    <server host="10.10.0.176" port="9003" type="tcp"/>
    <server host="10.10.0.176" port="9004" type="tcp"/>
    -->
  </servers>

  <load>
    <arrivalphase phase="1" duration="@duration" unit="second">
      <users maxnumber="@maxuser" arrivalrate="@user" unit="second"/>
    </arrivalphase>
  </load>


<sessions>
    <session name="test" probability="100" type="ts_http">
      <for from="1" to="@loop" incr="1" var="counter">
        <setdynvars sourcetype="eval"
                    code="fun() -> random:uniform() end.">
          <var name="decimal" />
        </setdynvars>
        <setdynvars sourcetype="random_number" start="1" end="10000">
           <var name="int_1_10000" />
        </setdynvars>
        <setdynvars sourcetype="random_number" start="10000000" end="11000000">
           <var name="user_id" />
        </setdynvars>
        <setdynvars sourcetype="random_string" length="10">
           <var name="string_10" />
        </setdynvars>

        <request subst="true">
          <http url="@api" method="@method" contents="@contents" version="1.1">
            <http_header name="Authorization" value="def7c5b70f04287effaaa402ecf9cd51"/>
            <http_header name="X-Devid" value="0"/>
            <http_header name="X-UserTag" value="208601471367"/>
            <http_header name="Cookie" value="authToken=bfb7f30010faefa67fb3bb23b0a798fb; Path=/"/>
            <http_header name="Content-Type" value="application/json"/>
          </http>
        </request>
        <thinktime value="1"/>
      </for>
    </session>
  </sessions>
</tsung>