shell/tsung_test.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">

<tsung loglevel="notice" dumptraffic="false" version="1.0">

  <clients>
    <client host="localhost" use_controller_vm="true"  maxusers="100000" />
  </clients>

  <servers>
    <server host="@server" port="@port" type="tcp"/>
    <!--
    <server host="10.10.0.176" port="9003" type="tcp"/>
    <server host="10.10.0.176" port="9004" type="tcp"/>
    -->
  </servers>

  <load>
    <arrivalphase phase="1" duration="@duration" unit="second">
      <users maxnumber="@maxuser" arrivalrate="@user" unit="second"/>
    </arrivalphase>
  </load>


<sessions>
    <session name="hellokitty" probability="@probabilityGet" type="ts_http">
      <for from="1" to="@loop" incr="1" var="counter">
        <setdynvars sourcetype="eval" code="fun({Pid,DynVars}) -> {{Y,M,D},{H,MM,S}} = calendar:now_to_local_time(erlang:now()),integer_to_list(Y)++integer_to_list(M)++integer_to_list(D)++integer_to_list(H)++integer_to_list(MM)++integer_to_list(S) end.">
           <var name="time"/>
        </setdynvars>

        <request>
          <http url="@api" method="GET" version="1.1">
            <http_header name="Authorization" value="def7c5b70f04287effaaa402ecf9cd51"/>
            <http_header name="Cookie" value="authToken=a2a2e9aab78774d8ea3b64b19d5506f9; Path=/"/>
            <http_header name="X-DevId" value="0"/>
            <http_header name="X-UserTag" value="0"/>
          </http>
        </request>
        <thinktime value="1"/>
      </for>
    </session> 
    
    <session name="hellokitty" probability="@probabilityPOST" type="ts_http">
      <for from="1" to="@loop" incr="1" var="counter">
        <setdynvars sourcetype="eval" code="fun({Pid,DynVars}) -> {{Y,M,D},{H,MM,S}} = calendar:now_to_local_time(erlang:now()),integer_to_list(Y)++integer_to_list(M)++integer_to_list(D)++integer_to_list(H)++integer_to_list(MM)++integer_to_list(S) end.">
           <var name="time"/>
        </setdynvars>
        <request>
          <http url="@api" method="POST" contents="@contents" version="1.1">
            <http_header name="Authorization" value="def7c5b70f04287effaaa402ecf9cd51"/>
            <http_header name="X-Devid" value="0"/>
            <http_header name="X-UserTag" value="208601471367"/>
            <http_header name="Cookie" value="authToken=a2a2e9aab78774d8ea3b64b19d5506f9; Path=/"/>
            <http_header name="Content-Type" value="application/json"/>
          </http>
        </request>

        <thinktime value="1"/>
      </for>
    </session>
  </sessions>
</tsung>